** The Fortran program

First, we focus on the Fortran program that will effectively perform the calculations.
As we said, we are going to calculate the force using newton's formula, which is, as we all know,
defined as: f = m * a.

Let's start with the simplest program possible:

#+BEGIN_SRC fortran
! newton0.f90
program newton
  implicit none
  integer mass, accel

  mass = 90
  accel = 80
  
  write (*,'(10i0)') force(mass, accel)

contains
  function force(m, a) result (f)
    implicit none
    integer m, a, f

    f = m * a
  end function force
end program newton
#+END_SRC

#+RESULTS:
: 7200

The program consists of a simple function definition for the newtonian formula, a couple of variable
declarations and assignments, and a write statement that prints the result of applying the function
on the variables as arguments.

We compile the program with "gfortran newton0.f90 -o newton". Running it in the terminal produces
the correct result.

For the next step, we need to process user input:

#+BEGIN_SRC fortran :stdin t
! newton.f90
program newton
  implicit none
  integer rstat
  integer mass, accel
  character(20) :: input

  do while(.true.)
     do while(.true.)
        read(*,'(A)',iostat=rstat) input

        if (rstat /= 0) then
           stop
        else
           if (input(1:4) == 'mass') then
              call maybe_read_int(mass, 4 + 2) 
           else if (input(1:5) == 'accel') then
              call maybe_read_int(accel, 5 + 2)
           else if (input(1:6) == 'return') then
              exit
           else
              write(*,*) 'bad input' 
           end if
        end if
     end do

     write (*,'(10i0)') force(mass, accel)

     mass = 0
     accel = 0
  end do

contains
  subroutine maybe_read_int(field, index)
    implicit none
    integer field, index

    read(input(index:), *, iostat=rstat) field
    if (rstat == 0) then
       write(*,'(10i0)') field
    else
       write(*,*) 'bad input'
    endif
  end subroutine maybe_read_int

  function force(m, a) result (f)
    implicit none
    integer m, a, f

    f = m * a
  end function force
end program newton
#+END_SRC

#+RESULTS:

The program starts with a loop, which reads the standard input and assigns its value to a string.
The input is matched to the expected patterns:

- mass [value]: stores the value in the mass variable
- accel [value]: stores the value in the accel variable
- return: exits the loop and proceeds to the next step

Next, the program prints the result of the force function over the variables, just like in the
previous snippet. Let's compile the program and run it in the terminal to see it in action.

 #+BEGIN_SRC
> ./newton
> mass 90
90
> accel 80
80
> return
7200
#+END_SRC

Great, we have successfully written a Fortran program that calculates the force using the newtonian formula.
Now, we need to write an Erlang program that is able to run it.

